xiaobaoaaaaaa/ESPaperPlay/sdkconfig.defaults
# ESPaperPlay sdkconfig defaults
# Applied when no sdkconfig exists yet (e.g. fresh clone / CI).
# Use `idf.py menuconfig` for project-specific overrides.

# Target: ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# Flash: 16 MB (ESP32-S3-WROOM-1-N16R8)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# PSRAM: 8 MB octal (ESP32-S3-WROOM-1-N16R8)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_ESPPSRAM64=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Web 管理：HTTPS + 运行时生成自签名证书（设备端自产密钥对，私钥永不出设备）
CONFIG_ESP_HTTPS_SERVER_ENABLE=y
CONFIG_MBEDTLS_X509_CREATE_C=y
# 生成 P-256 密钥对 / 证书需较大栈；main 任务在 app_main 返回后即销毁，无长期开销
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# 编译优化：-O2（默认 -Og 使 GUI 转换循环慢 2-4 倍；-O2 后转换耗时显著下降）
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# 编译优化：-O2（默认 -Og 使 GUI 转换循环慢 2-4 倍；-O2 后转换耗时显著下降）
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# CPU 动态调频（DFS）：繁忙升 240MHz，空闲自动降 80MHz（平衡功耗与性能）
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
# 自定义分区表：APP 4MB（LVGL / 阅读器代码空间）
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# LVGL 字体：大字号数字（局刷测试屏计数器用）
CONFIG_LV_FONT_MONTSERRAT_48=y
# LVGL 自带 benchmark（压力测试屏：多场景高速重绘暴露局刷竞态）
CONFIG_LV_BUILD_DEMOS=y
CONFIG_LV_USE_DEMO_BENCHMARK=y
